# Panda

In [2]:
import numpy as np

In [11]:
import pandas as pd

In [17]:
from numpy.random import randn

In [30]:
marcas_de_carros = ["Ford", "Cheverolet", "Nissan", "Mercedez"]

In [31]:
modelos_de_carros = ["mustang", "camaro", "versa", "GLA200"]

In [34]:
carros = pd.Series(modelos_de_carros, marcas_de_carros)

In [36]:
carros

Ford          mustang
Cheverolet     camaro
Nissan          versa
Mercedez       GLA200
dtype: object

In [37]:
carros["Mercedez"]

'GLA200'

In [14]:
np.random.seed(101)

In [19]:
df = pd.DataFrame(randn(5,4), ["A", "B", "C", "D", "E"], ["W", "X", "Y", "Z"])df

In [21]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [38]:
df["W"]["A"]

0.3026654485851825

In [41]:
df[["W","Z"]]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [43]:
df["New"] = df["W"] + df["Y"]

In [46]:
df

          W         X         Y         Z       New
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [53]:
df.drop("New", axis=1, inplace=True)

In [55]:
df.drop("E", axis=0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [57]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [60]:
df.loc["A"]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [62]:
df.iloc[0]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [64]:
df.loc[["A","B"], ["Y","Z"]]

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502

In [67]:
df > 0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [69]:
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [73]:
df["W"]>0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [76]:
df[df["W"]>0]["X"]

A    1.693723
C    0.072960
Name: X, dtype: float64

In [83]:
df[(df["W"]>0) & (df["Y"]>0)]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [85]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [90]:
df["W"][4]

-0.11677331646707445

In [92]:
new_id = 'RJ SP MG BA ES'.split()

In [94]:
new_id

['RJ', 'SP', 'MG', 'BA', 'ES']

In [96]:
df['Estados'] = new_id

In [98]:
df

          W         X         Y         Z Estados
A  0.302665  1.693723 -1.706086 -1.159119      RJ
B -0.134841  0.390528  0.166905  0.184502      SP
C  0.807706  0.072960  0.638787  0.329646      MG
D -0.497104 -0.754070 -0.943406  0.484752      BA
E -0.116773  1.901755  0.238127  1.996652      ES

In [102]:
df.set_index('Estados', inplace=True)

In [104]:
df

                W         X         Y         Z
Estados
RJ       0.302665  1.693723 -1.706086 -1.159119
SP      -0.134841  0.390528  0.166905  0.184502
MG       0.807706  0.072960  0.638787  0.329646
BA      -0.497104 -0.754070 -0.943406  0.484752
ES      -0.116773  1.901755  0.238127  1.996652

### Missing Data

In [106]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [110]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [118]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [120]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [123]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [131]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

In [135]:
df.fillna(value=5)

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  5.0  5.0  3

In [140]:
df.fillna(value="Vazio")

       A      B  C
0    1.0    5.0  1
1    2.0  Vazio  2
2  Vazio  Vazio  3

In [139]:
df["A"].fillna(value=120)

0      1.0
1      2.0
2    120.0
Name: A, dtype: float64

### Gruopby

In [142]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [145]:
df = pd.DataFrame(data)

In [147]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [154]:
by_company = df.groupby("Company")

In [156]:
by_company.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [158]:
by_company.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [160]:
by_company.sum().loc["FB"]

Sales    593
Name: FB, dtype: int64

### Merging and Concatenating

In [166]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [164]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [167]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [169]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [170]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [171]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [173]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [176]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Operations

In [178]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [180]:
df['col2']

0    444
1    555
2    666
3    444
Name: col2, dtype: int64

In [182]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [184]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [189]:
df[(df['col1']>2) & (df['col2']==666)]

   col1  col2 col3
2     3   666  ghi

In [196]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [197]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [192]:
def times2(x):
    return x*2

In [198]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [199]:
times2(df['col1'])

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [201]:
df['col3'].apply(times2)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [203]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [205]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [207]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [210]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [215]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [218]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### Data Input and Output

In [220]:
pwd

'C:\\Users\\calis\\Downloads\\Py_DS_ML_Bootcamp-master\\Refactored_Py_DS_ML_Bootcamp-master\\03-Python-for-Data-Analysis-Pandas'

In [232]:
df = pd.read_csv('example')

In [233]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [239]:
df.to_csv('My_output')

In [241]:
pd.read_csv('My_output')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [243]:
df.to_csv('My_output', index=False)

In [245]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [260]:
  pd.read_excel('Excel_Sample.xlxs',sheet_name="Sheet1")

FileNotFoundError: [Errno 2] No such file or directory: 'Excel_Sample.xlxs'

In [264]:
from sqlalchemy import create_engine

In [266]:
engine = create_engine('sqlite:///:memory:')

In [277]:
df.to_sql('data2', engine)

In [280]:
sqldf = pd.read_sql('data2', con=engine)

In [281]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15